---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarConstraintsManager.Dispose
source: html/ed88eaca-9e47-38a8-4515-b130810de0df.htm
---
# Autodesk.Revit.DB.Structure.RebarConstraintsManager.Dispose Method

Releases all resources used by the RebarConstraintsManager

## Syntax (C#)
```csharp
public void Dispose()
```